src/DataProcessors/ГрупповоеЗаполнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеЗаполнение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоощрения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поощрения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВзыскания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофессияСпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофессииРабочих</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрофессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоощрения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поощрения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВзыскания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Профессия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофессииРабочих</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПрофессии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разряд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ГрупповоеЗаполнение/Ext/ObjectModule.bsl
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура СформироватьОтчет() Экспорт
	Если ТипЗаполнения <> 4 Тогда
		Если ДатаПриказа = Дата(1,1,1) Тогда
			Предупреждение("Не указана дата приказа!");
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(НомерПриказа) Тогда
			Предупреждение("Не указан номер приказа!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого НоваяСтр Из ТабличнаяЧасть Цикл
		Если Не ЗначениеЗаполнено(НоваяСтр.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		
		СпрСотрудники = НоваяСтр.Сотрудник.ПолучитьОбъект();
		РезультатПоискаСотрудник = СпрСотрудники.Физлицо.ПолучитьОбъект();

		Если ТипЗаполнения = 1 Тогда  //поощрения
			НоваяСтрТабл  = РезультатПоискаСотрудник.Поощрения.Добавить();
			НоваяСтрТабл.ДатаПоощрения = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаПоощрения = НомерПриказа;
			НоваяСтрТабл.ТекстПоощрения = ?(ПустаяСтрока(НоваяСтр.Текст), Текст, НоваяСтр.Текст);
			НоваяСтрТабл.ТипПоощрения = ?(ЗначениеЗаполнено(НоваяСтр.ТипПоощрения), ТипПоощрения, НоваяСтр.ТипПоощрения);
			НоваяСтрТабл.ПримечаниеПоощрения = ?(ПустаяСтрока(НоваяСтр.Примечание), Примечание, НоваяСтр.Примечание);	
		ИначеЕсли ТипЗаполнения = 2 Тогда //взыскания
			НоваяСтрТабл  = РезультатПоискаСотрудник.Взыскания.Добавить();
			НоваяСтрТабл.ДатаВзыскания = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаВзыскания = НомерПриказа;
			НоваяСтрТабл.ТекстВзыскания = ?(ПустаяСтрока(НоваяСтр.Текст), Текст, НоваяСтр.Текст);
			НоваяСтрТабл.ТипВзыскания = ?(ЗначениеЗаполнено(НоваяСтр.ТипВзыскания), ТипВзыскания, НоваяСтр.ТипВзыскания);
			НоваяСтрТабл.ПримечаниеВзыскания = ?(ПустаяСтрока(НоваяСтр.Примечание), Примечание, НоваяСтр.Примечание);				
		ИначеЕсли ТипЗаполнения = 3 Тогда //профессии
			НоваяСтрТабл  = РезультатПоискаСотрудник.Профессии.Добавить();
			НоваяСтрТабл.Профессия = ?(ПустаяСтрока(НоваяСтр.Профессия), ПрофессияСпр, НоваяСтр.Профессия);
			НоваяСтрТабл.ТипПрофессии = ?(ПустаяСтрока(НоваяСтр.ТипПрофессии), ТипПрофессии, НоваяСтр.ТипПрофессии);
			НоваяСтрТабл.Разряд = ?(ПустаяСтрока(НоваяСтр.Разряд), Разряд, НоваяСтр.Разряд);
			НоваяСтрТабл.НомерПриказа = НомерПриказа;
			НоваяСтрТабл.ДатаПриказа = ДатаПриказа;	
		КонецЕсли;
		
		Если ТипЗаполнения = 1 Тогда  //поощрения
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили ПООЩРЕНИЕ");
		ИначеЕсли ТипЗаполнения = 2 Тогда //взыскания
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили ВЗЫСКАНИЕ");
		ИначеЕсли ТипЗаполнения = 3 Тогда //профессии
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили ПРОФЕССИЮ");
		ИначеЕсли ТипЗаполнения = 4 Тогда //аттестация
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили АТТЕСТАЦИЮ");
		КонецЕсли;
		
		РезультатПоискаСотрудник.Записать();
	КонецЦикла;
КонецПроцедуры // ()
